Repository: mubtAAhij/CodeEdit
Catalog: CodeEdit/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fr_fr, zh_cn

# npm.package-not-found-in-modules
source: Package not found in node_modules
es_419: Paquete no encontrado en node_modules
fr_fr: Paquet introuvable dans node_modules
zh_cn: 在 node_modules 中找不到包

# font-weight.ultra-light
source: Ultra Light
es_419: Ultra ligera
fr_fr: Ultra-léger
zh_cn: 极细

# font-weight.thin
source: Thin
es_419: Fina
fr_fr: Fin
zh_cn: 纤细

# font-weight.regular
source: Regular
es_419: Normal
fr_fr: Normal
zh_cn: 常规

# font-weight.medium
source: Medium
es_419: Mediano
fr_fr: Moyen
zh_cn: 中

# font-weight.semi-bold
source: Semi Bold
es_419: Seminegrita
fr_fr: Demi-gras
zh_cn: 半粗体

# font-weight.bold
source: Bold
es_419: Negrita
fr_fr: Gras
zh_cn: 粗体

# font-weight.heavy
source: Heavy
es_419: Gruesa
fr_fr: Épais
zh_cn: 重体

# font-weight.black
source: Black
es_419: Negra
fr_fr: Noir
zh_cn: 黑体

# font-weight.unknown
source: Unknown
es_419: Desconocido
fr_fr: Inconnu
zh_cn: 未知

# task-form.name
source: Name
es_419: Nombre
fr_fr: Nom
zh_cn: 名称

# task-form.name-accessibility
source: Task Name
es_419: Nombre de la tarea
fr_fr: Nom de la tâche
zh_cn: 任务名称

# task-form.target
source: Target
es_419: Destino
fr_fr: Cible
zh_cn: 目标

# task-form.target.my-mac
source: My Mac
es_419: Mi Mac
fr_fr: Mon Mac
zh_cn: 我的 Mac

# task-form.target.my-mac-tag
source: My Mac
es_419: Mi Mac
fr_fr: Mon Mac
zh_cn: 我的 Mac

# task-form.task
source: Task
es_419: Tarea
fr_fr: Tâche
zh_cn: 任务

# task-form.task-command
source: Task Command
es_419: Comando de tarea
fr_fr: Commande de tâche
zh_cn: 任务命令

# task-form.working-directory
source: Working Directory
es_419: Directorio de trabajo
fr_fr: Répertoire de travail
zh_cn: 工作目录

# task-form.no-environment-variables
source: No environment variables
es_419: Sin variables de entorno
fr_fr: Aucune variable d'environnement
zh_cn: 无环境变量

# task-form.environment-variables
source: Environment Variables
es_419: Variables de entorno
fr_fr: Variables d'environnement
zh_cn: 环境变量

# file.new
source: New
es_419: Nuevo
fr_fr: Nouveau
zh_cn: 新建

# file.open
source: Open...
es_419: Abrir...
fr_fr: Ouvrir...
zh_cn: 打开...

# file.open-recent
source: Open Recent
es_419: Abrir recientes
fr_fr: Ouvrir un élément récent
zh_cn: 打开最近文件

# file.open-quickly
source: Open Quickly
es_419: Abrir rápidamente
fr_fr: Ouverture rapide
zh_cn: 快速打开

# file.close-tab
source: Close Tab
es_419: Cerrar pestaña
fr_fr: Fermer l'onglet
zh_cn: 关闭标签页

# file.close-editor
source: Close Editor
es_419: Cerrar editor
fr_fr: Fermer l'éditeur
zh_cn: 关闭编辑器

# file.close-window
source: Close Window
es_419: Cerrar ventana
fr_fr: Fermer la fenêtre
zh_cn: 关闭窗口

# file.close-workspace
source: Close Workspace
es_419: Cerrar área de trabajo
fr_fr: Fermer l'espace de travail
zh_cn: 关闭工作区

# file.close-terminal
source: Close Terminal
es_419: Cerrar terminal
fr_fr: Fermer le terminal
zh_cn: 关闭终端

# file.workspace-settings
source: Workspace Settings
es_419: Configuración del área de trabajo
fr_fr: Réglages de l'espace de travail
zh_cn: 工作区设置

# file.save
source: Save
es_419: Guardar
fr_fr: Enregistrer
zh_cn: 保存

# stash.message-optional
source: Message (optional)
es_419: Mensaje (opcional)
fr_fr: Message (facultatif)
zh_cn: 消息(可选)

# stash.title
source: Stash Changes
es_419: Guardar cambios en stash
fr_fr: Remiser les modifications
zh_cn: 贮藏更改

# stash.uncommitted-changes-description
source: Your local repository has uncommitted changes that need to be stashed before you can continue. Enter a description for your changes.
es_419: Tu repositorio local tiene cambios sin confirmar que deben guardarse en stash antes de continuar. Ingresa una descripción para tus cambios.
fr_fr: Le dépôt local contient des modifications non validées qui doivent être remisées avant de continuer. Entrez une description pour vos modifications.
zh_cn: 你的本地仓库有未提交的更改，需要先贮藏才能继续。请输入对你的更改的描述。

# stash.description
source: Enter a description for your stashed changes so you can reference them later. Stashes will appear in the Source Control navigator for your repository.
es_419: Ingresa una descripción para los cambios guardados en stash para que puedas referenciarlos más adelante. Los stashes aparecerán en el navegador de control de versiones de tu repositorio.
fr_fr: Entrez une description pour votre remise afin de pouvoir la référencer ultérieurement. Les remises apparaîtront dans le navigateur de contrôle de version pour votre dépôt.
zh_cn: 为您贮藏的更改输入描述,以便日后引用。贮藏将显示在您仓库的版本控制导航器中。

# stash.apply-after-operation
source: Apply stash after operation
es_419: Aplicar stash después de la operación
fr_fr: Appliquer la remise après l'opération
zh_cn: 操作后应用贮藏

# stash.stash-and-pull
source: Stash and Pull
es_419: Guardar en stash y hacer pull
fr_fr: Remiser et Pull
zh_cn: 贮藏并拉取

# stash.stash-and-switch
source: Stash and Switch
es_419: Guardar en stash y cambiar
fr_fr: Remiser et basculer
zh_cn: 贮藏并切换

# stash.stash
source: Stash
fr_fr: Remise
zh_cn: 贮藏

# stash.error.not-found
source: Could not find last stash
es_419: No se encontró el último stash
fr_fr: Impossible de trouver la dernière remise
zh_cn: 未找到最后一次贮藏

# stash.error.failed
source: Failed to stash changes
es_419: No se pudo guardar los cambios en stash
fr_fr: Échec de la remise des modifications
zh_cn: 贮藏更改失败

# search-mode.containing
source: Containing
es_419: Que contiene
fr_fr: Contenant
zh_cn: 包含

# search-mode.matching-word
source: Matching Word
es_419: Coincidir palabra
fr_fr: Mot entier
zh_cn: 匹配整词

# search-mode.starting-with
source: Starting With
es_419: Que comienza con
fr_fr: Commence par
zh_cn: 开头为

# search-mode.ending-with
source: Ending With
es_419: Termina con
fr_fr: Se terminant par
zh_cn: 结尾为

# search-mode.text
source: Text
es_419: Texto
fr_fr: Texte
zh_cn: 文本

# search-mode.references
source: References
es_419: Referencias
fr_fr: Références
zh_cn: 引用

# search-mode.definitions
source: Definitions
es_419: Definiciones
fr_fr: Définitions
zh_cn: 定义

# search-mode.regular-expression
source: Regular Expression
es_419: Expresión regular
fr_fr: Expression régulière
zh_cn: 正则表达式

# search-mode.call-hierarchy
source: Call Hierarchy
es_419: Jerarquía de llamadas
fr_fr: Hiérarchie des appels
zh_cn: 调用层次结构

# search-mode.find
source: Find
es_419: Buscar
fr_fr: Rechercher
zh_cn: 查找

# search-mode.replace
source: Replace
es_419: Reemplazar
fr_fr: Remplacer
zh_cn: 替换

# project-navigator.untitled
source: untitled
es_419: sin título
fr_fr: sans titre
zh_cn: 未命名

# project-navigator.new-folder-with-items
source: New Folder With Items
es_419: Carpeta nueva con elementos
fr_fr: Nouveau dossier avec éléments
zh_cn: 新建包含项目的文件夹

# project-navigator.new-folder-with-items-numbered
source: New Folder With Items %d
es_419: Carpeta nueva con elementos %d
fr_fr: Nouveau dossier avec éléments %d
zh_cn: 包含项目的新建文件夹 %d

# source-control.menu
source: Source Control
es_419: Control de versiones
fr_fr: Contrôle de version
zh_cn: 版本控制

# source-control.commit
source: Commit...
fr_fr: Committer...
zh_cn: 提交...

# source-control.push
source: Push...
fr_fr: Pusher...
zh_cn: 推送...

# source-control.pull
source: Pull...
fr_fr: Tirer...
zh_cn: 拉取...

# source-control.fetch-changes
source: Fetch Changes
es_419: Hacer Fetch de Cambios
fr_fr: Récupérer les modifications
zh_cn: 获取更改

# source-control.stage-all
source: Stage All Changes
es_419: Preparar todos los cambios
fr_fr: Tout indexer
zh_cn: 暂存所有更改

# source-control.error.stage-failed
source: Failed To Stage Changes
es_419: No se pudieron preparar los cambios
fr_fr: Échec de l'indexation des modifications
zh_cn: 暂存更改失败

# source-control.unstage-all
source: Unstage All Changes
es_419: Quitar Todos los Cambios del Stage
fr_fr: Désindexer toutes les modifications
zh_cn: 取消暂存全部更改

# source-control.error.unstage-failed
source: Failed To Unstage Changes
es_419: No se Pudieron Quitar los Cambios del Stage
fr_fr: Échec de la désindexation des modifications
zh_cn: 取消暂存更改失败

# source-control.add-remote
source: Add Exisiting Remote...
es_419: Agregar remoto existente...
fr_fr: Ajouter un distant existant...
zh_cn: 添加现有远程...

# warning-chars.end-of-text
source: End of text
es_419: Fin de texto
fr_fr: Fin de texte
zh_cn: 文本结束

# warning-chars.non-breaking-space
source: Non-breaking space
es_419: Espacio de no separación
fr_fr: Espace insécable
zh_cn: 不间断空格

# warning-chars.narrow-non-breaking-space
source: Narrow non-breaking space
es_419: Espacio de no separación estrecho
fr_fr: Espace insécable étroite
zh_cn: 窄不换行空格

# warning-chars.zero-width-space
source: Zero-width space
es_419: Espacio de ancho cero
fr_fr: Espace sans largeur
zh_cn: 零宽空格

# warning-chars.zero-width-non-joiner
source: Zero-width non-joiner
es_419: Espacio de unión de ancho cero
fr_fr: Antiliant sans chasse
zh_cn: 零宽非连字符

# warning-chars.paragraph-separator
source: Paragraph separator
es_419: Separador de párrafo
fr_fr: Séparateur de paragraphe
zh_cn: 段落分隔符

# warning-chars.em-dash
source: Em-dash
es_419: Raya
fr_fr: Tiret cadratin
zh_cn: 破折号

# warning-chars.soft-hyphen
source: Soft hyphen
es_419: Guion suave
fr_fr: Trait d'union conditionnel
zh_cn: 软连字符

# warning-chars.left-single-quote
source: Left single quote
es_419: Comilla simple izquierda
fr_fr: Guillemet simple gauche
zh_cn: 左单引号

# warning-chars.right-single-quote
source: Right single quote
es_419: Comilla simple derecha
fr_fr: Guillemet-apostrophe fermant
zh_cn: 右单引号

# warning-chars.left-double-quote
source: Left double quote
es_419: Comilla doble izquierda
fr_fr: Guillemet double ouvrant
zh_cn: 左双引号

# warning-chars.right-double-quote
source: Right double quote
es_419: Comilla doble derecha
fr_fr: Guillemet double fermant
zh_cn: 右双引号

# warning-chars.greek-question-mark
source: Greek Question Mark
es_419: Signo de interrogación griego
fr_fr: Point d'interrogation grec
zh_cn: 希腊问号

# language-server.install-using
source: Install using %@
es_419: Instalar usando %@
fr_fr: Installer avec %@
zh_cn: 使用 %@ 安装

# language-server.show-more
source: Show More
es_419: Mostrar más
fr_fr: Afficher plus
zh_cn: 显示更多

# language-server.show-less
source: Show Less
es_419: Mostrar menos
fr_fr: Afficher moins
zh_cn: 显示更少

# language-server.remove-confirmation-title
source: Remove %@?
es_419: ¿Eliminar %@?
fr_fr: Supprimer %@ ?
zh_cn: 移除 %@?

# language-server.remove-confirmation-message
source: Are you sure you want to remove this language server? This action cannot be undone.
es_419: ¿Estás seguro de que quieres quitar este servidor de lenguaje? Esta acción no se puede deshacer.
fr_fr: Voulez-vous vraiment retirer ce serveur de langage ? Cette action est irréversible.
zh_cn: 确定要移除此语言服务器吗?此操作无法撤销。

# language-server.removal-failed
source: Removal Failed
es_419: Error al eliminar
fr_fr: Échec de la suppression
zh_cn: 移除失败

# language-server.unknown-error
source: An unknown error occurred
es_419: Ocurrió un error desconocido
fr_fr: Une erreur inconnue s'est produite
zh_cn: 发生未知错误

# language-server.retry
source: Retry
es_419: Reintentar
fr_fr: Réessayer
zh_cn: 重试

# language-server.install
source: Install
es_419: Instalar
fr_fr: Installer
zh_cn: 安装

source: Commit message (required)
es_419: Mensaje de commit (requerido)
fr_fr: Message de commit (requis)
zh_cn: 提交消息(必填)

# commit.detailed-description
source: Detailed description
es_419: Descripción detallada
fr_fr: Description détaillée
zh_cn: 详细描述

# commit.amend
source: Amend
es_419: Enmendar
fr_fr: Modifier
zh_cn: 修正

# commit.unstage-all
source: Unstage All
es_419: Quitar Todo del Stage
fr_fr: Tout désindexer
zh_cn: 取消暂存全部

# commit.stage-all
source: Stage All
es_419: Preparar todo
fr_fr: Tout indexer
zh_cn: 全部暂存

# commit.committing
source: Committing...
es_419: Haciendo commit...
fr_fr: Commit en cours...
zh_cn: 正在提交...

# commit.commit
source: Commit
fr_fr: Committer
zh_cn: 提交

# commit.commit-and-push
source: Commit and Push...
es_419: Commit y Push...
fr_fr: Committer et pusher...
zh_cn: 提交并推送...

# commit.error.failed-to-commit
source: Failed to commit
es_419: No se pudo hacer commit
fr_fr: Échec du commit
zh_cn: 提交失败

# commit.error.failed-to-push
source: Failed to push
es_419: No se pudo hacer push
fr_fr: Échec du push
zh_cn: 推送失败

# commit.error.failed-to-stage-all
source: Failed to stage all files: %@
es_419: No se pudo preparar todos los archivos: %@
fr_fr: Échec de l'indexation de tous les fichiers : %@
zh_cn: 暂存所有文件失败：%@

# commit.error.failed-to-reset-all
source: Failed to reset all files: %@
es_419: No se pudo restablecer todos los archivos: %@
fr_fr: Échec de la réinitialisation de tous les fichiers : %@
zh_cn: 重置所有文件失败：%@

# project-navigator.filter
source: Filter
es_419: Filtrar
fr_fr: Filtrer
zh_cn: 过滤

# project-navigator.alphabetically
source: Alphabetically
es_419: Alfabéticamente
fr_fr: Par ordre alphabétique
zh_cn: 按字母顺序

# project-navigator.folders-on-top
source: Folders on top
es_419: Carpetas arriba
fr_fr: Dossiers en haut
zh_cn: 文件夹在顶部

# project-navigator.filter-help
source: Show files with matching name
es_419: Mostrar archivos con nombre coincidente
fr_fr: Afficher les fichiers avec le nom correspondant
zh_cn: 显示匹配名称的文件

# project-navigator.recent-files-help
source: Show only recent files
es_419: Mostrar solo archivos recientes
fr_fr: Afficher uniquement les fichiers récents
zh_cn: 仅显示最近文件

# project-navigator.source-control-help
source: Show only files with source-control status
es_419: Mostrar solo archivos con estado de control de versiones
fr_fr: Afficher uniquement les fichiers avec un état de contrôle de version
zh_cn: 仅显示具有版本控制状态的文件

# project-navigator.add-file
source: Add File
es_419: Agregar archivo
fr_fr: Ajouter un fichier
zh_cn: 添加文件

# project-navigator.add-folder
source: Add Folder
es_419: Agregar carpeta
fr_fr: Ajouter un dossier
zh_cn: 添加文件夹

# project-navigator.add-folder-or-file
source: Add Folder or File
es_419: Agregar carpeta o archivo
fr_fr: Ajouter un dossier ou un fichier
zh_cn: 添加文件夹或文件

# git-clone.git-not-found
source: Git installation not found.
es_419: No se encontró la instalación de Git.
fr_fr: Installation de Git introuvable.
zh_cn: 未找到 Git 安装。

# git-clone.git-not-found-info
source: Ensure Git is installed on your system and try again.
es_419: Asegúrate de que Git esté instalado en tu sistema e intenta de nuevo.
fr_fr: Assurez-vous que Git est installé sur votre système et réessayez.
zh_cn: 请确保您的系统已安装 Git，然后重试。

# git-clone.url-empty
source: Url cannot be empty
es_419: La URL no puede estar vacía
fr_fr: L'URL ne peut pas être vide
zh_cn: URL 不能为空

# git-clone.url-empty-info
source: You must specify a repository to clone
es_419: Debes especificar un repositorio para clonar
fr_fr: Vous devez spécifier un dépôt à cloner
zh_cn: 必须指定要克隆的仓库

# git-clone.directory-exists
source: Directory already exists
es_419: El directorio ya existe
fr_fr: Le répertoire existe déjà
zh_cn: 目录已存在

# git-clone.failed-to-create-folder
source: Failed to create folder
es_419: No se pudo crear la carpeta
fr_fr: Échec de la création du dossier
zh_cn: 创建文件夹失败

# git-clone.failed-to-clone
source: Failed to clone
es_419: No se pudo clonar
fr_fr: Échec du clonage
zh_cn: 克隆失败

# git-clone.failed-to-delete-folder
source: Failed to delete folder
es_419: No se pudo eliminar la carpeta
fr_fr: Échec de la suppression du dossier
zh_cn: 删除文件夹失败

# git-clone.clone-prompt
source: Clone
es_419: Clonar
fr_fr: Cloner
zh_cn: 克隆

# git-clone.clone-as-label
source: Clone as
es_419: Clonar como
fr_fr: Cloner sous
zh_cn: 克隆为

# terminal-settings.shell.system-default
source: System Default
es_419: Predeterminado del sistema
fr_fr: Système par défaut
zh_cn: 系统默认

# terminal-settings.cursor-style
source: Terminal Cursor Style
es_419: Estilo de cursor de terminal
fr_fr: Style du curseur du terminal
zh_cn: 终端光标样式

# terminal-settings.cursor-style.block
source: Block
es_419: Bloque
fr_fr: Bloc
zh_cn: 块状

# terminal-settings.cursor-style.underline
source: Underline
es_419: Subrayado
fr_fr: Souligner
zh_cn: 下划线

# terminal-settings.cursor-style.bar
source: Bar
es_419: Barra
fr_fr: Barre
zh_cn: 竖线

# terminal-settings.blink-cursor
source: Blink Cursor
es_419: Cursor parpadeante
fr_fr: Curseur clignotant
zh_cn: 光标闪烁

# terminal-settings.option-as-meta
source: Use "Option" key as "Meta"
es_419: Usar tecla \"Option\" como \"Meta\"
fr_fr: Utiliser la touche « Option » comme « Meta »
zh_cn: 将 \"Option\" 键用作 \"Meta\"

# terminal-settings.use-text-editor-font
source: Use text editor font
es_419: Usar fuente del editor de texto
fr_fr: Utiliser la police de l'éditeur de texte
zh_cn: 使用文本编辑器字体

# terminal-settings.shell-integration
source: Shell Integration
es_419: Integración de Shell
fr_fr: Intégration du shell
zh_cn: Shell 集成

# terminal-settings.shell-integration-help
source: CodeEdit supports integrating with common shells such as Bash and Zsh. This enables features like terminal title detection.
es_419: CodeEdit es compatible con la integración de shells comunes como Bash y Zsh. Esto habilita funcionalidades como la detección de título de terminal.
fr_fr: CodeEdit prend en charge l'intégration avec les shells courants tels que Bash et Zsh. Cela permet des fonctionnalités comme la détection du titre de terminal.
zh_cn: CodeEdit 支持与 Bash 和 Zsh 等常见 Shell 集成。这将启用终端标题检测等功能。

# terminal-settings.shell-integration-warning
source: Warning: Disabling integration disables features such as terminal title detection.
es_419: Advertencia: Desactivar la integración desactiva funcionalidades como la detección de título del terminal.
fr_fr: Avertissement : Désactiver l'intégration désactive des fonctionnalités telles que la détection du titre du terminal.
zh_cn: 警告：停用集成会停用终端标题检测等功能。

# terminal-settings.use-login-shell
source: Use Login Shell
es_419: Usar Shell de Inicio de Sesión
fr_fr: Utiliser un shell de connexion
zh_cn: 使用登录 Shell

# terminal-settings.use-login-shell-help
source: Whether or not to use a login shell when starting a terminal session. By default, a login shell is used used similar to Terminal.app.
es_419: Define si se usa o no un shell de inicio de sesión al iniciar una sesión de terminal. De forma predeterminada, se usa un shell de inicio de sesión similar a Terminal.app.
fr_fr: Utiliser ou non un shell de connexion lors du démarrage d'une session terminal. Par défaut, un shell de connexion est utilisé de manière similaire à Terminal.app.
zh_cn: 启动终端会话时是否使用登录 shell。默认情况下，会使用登录 shell，与 Terminal.app 的行为类似。

# git-settings.configuration-title
source: Git Configuration
es_419: Configuración de Git
fr_fr: Configuration Git
zh_cn: Git 配置

# git-settings.configuration-description
source: Applied globally to all repositories on your Mac. [Learn more...](https://git-scm.com/docs/git-config)
es_419: Se aplica globalmente a todos los repositorios en tu Mac. [Más información...](https://git-scm.com/docs/git-config)
fr_fr: Appliqué globalement à tous les dépôts sur votre Mac. [En savoir plus...](https://git-scm.com/docs/git-config)
zh_cn: 全局应用于 Mac 上的所有仓库。[了解更多...](https://git-scm.com/docs/git-config)

# git-settings.ignored-files-title
source: Ignored Files
es_419: Archivos Ignorados
fr_fr: Fichiers ignorés
zh_cn: 忽略文件

# git-settings.ignored-files-description
source: Patterns for files and folders that Git should ignore and not track. Applied globally to all repositories on your Mac. [Learn more...](https://git-scm.com/docs/gitignore)
es_419: Patrones para archivos y carpetas que Git debe ignorar y no rastrear. Se aplican globalmente a todos los repositorios en tu Mac. [Más información...](https://git-scm.com/docs/gitignore)
fr_fr: Motifs pour les fichiers et dossiers que Git doit ignorer et ne pas suivre. Appliqués globalement à tous les dépôts sur votre Mac. [En savoir plus...](https://git-scm.com/docs/gitignore)
zh_cn: Git 应忽略且不跟踪的文件和文件夹的模式。全局应用于您 Mac 上的所有仓库。[了解更多...](https://git-scm.com/docs/gitignore)

# git-settings.author-name
source: Author Name
es_419: Nombre del autor
fr_fr: Nom de l'auteur
zh_cn: 作者名称

# git-settings.author-email
source: Author Email
es_419: Correo del autor
fr_fr: E-mail de l'auteur
zh_cn: 作者邮箱

# git-settings.default-branch-name
source: Default branch name
es_419: Nombre de rama predeterminado
fr_fr: Nom de branche par défaut
zh_cn: 默认分支名称

# git-settings.default-branch-name-help
source: Cannot contain spaces, backslashes, or other symbols
es_419: No puede contener espacios, barras invertidas ni otros símbolos
fr_fr: Ne peut pas contenir d'espaces, de barres obliques inverses ou d'autres symboles
zh_cn: 不得包含空格、反斜杠或其他符号

# git-settings.prefer-rebase-when-pulling
source: Prefer to rebase when pulling
es_419: Preferir rebase al hacer pull
fr_fr: Privilégier le rebase lors du pull
zh_cn: 拉取时优先使用 rebase

# git-settings.show-merge-commits-per-file-log
source: Show merge commits in per-file log
es_419: Mostrar commits de fusión en el registro por archivo
fr_fr: Afficher les commits de fusion dans le journal par fichier
zh_cn: 在单个文件日志中显示合并提交

# git-settings.config-file-location
source: Git configuration is stored in "~/.gitconfig".
es_419: La configuración de Git se almacena en \"~/.gitconfig\".
fr_fr: La configuration Git est stockée dans « ~/.gitconfig ».
zh_cn: Git 配置存储在\"~/.gitconfig\"中。

# git-settings.ignore-file-location
source: Ignored file patterns are stored in "%@".
es_419: Los patrones de archivos ignorados se almacenan en \"%@\".
fr_fr: Les motifs de fichiers ignorés sont stockés dans « %@ ».
zh_cn: 忽略文件模式存储在\"%@\"中。

# git-settings.open-in-editor-ignore
source: Open in Editor...
es_419: Abrir en editor...
fr_fr: Ouvrir dans l'éditeur...
zh_cn: 在编辑器中打开...

# source-control-settings.general.section-title
source: Source Control
es_419: Control de versiones
fr_fr: Contrôle de version
zh_cn: 版本控制

# source-control-settings.text-editing-title
source: Text Editing
es_419: Edición de texto
fr_fr: Édition de texte
zh_cn: 文本编辑

# source-control-settings.refresh-local-status-auto
source: Refresh local status automatically
es_419: Actualizar estado local automáticamente
fr_fr: Actualiser l'état local automatiquement
zh_cn: 自动刷新本地状态

# source-control-settings.fetch-refresh-server-status-auto
source: Fetch and refresh server status automatically
es_419: Hacer fetch y actualizar estado del servidor automáticamente
fr_fr: Récupérer et actualiser l'état du serveur automatiquement
zh_cn: 自动获取并刷新服务器状态

# source-control-settings.add-remove-files-auto
source: Add and remove files automatically
es_419: Agregar y quitar archivos automáticamente
fr_fr: Ajouter et retirer les fichiers automatiquement
zh_cn: 自动添加和移除文件

# source-control-settings.select-files-to-commit-auto
source: Select files to commit automatically
es_419: Seleccionar archivos para commit automáticamente
fr_fr: Sélectionner automatiquement les fichiers à committer
zh_cn: 自动选择要提交的文件

# source-control-settings.show-source-control-changes
source: Show source control changes
es_419: Mostrar cambios de control de versiones
fr_fr: Afficher les modifications du contrôle de version
zh_cn: 显示版本控制更改

# source-control-settings.include-upstream-changes
source: Include upstream changes
es_419: Incluir cambios remotos
fr_fr: Inclure les modifications en amont
zh_cn: 包含上游更改

# source-control-settings.comparison-view
source: Comparison view
es_419: Vista de comparación
fr_fr: Affichage de comparaison
zh_cn: 对比视图

# source-control-settings.local-revision-left
source: Local Revision on Left Side
es_419: Revisión local a la izquierda
fr_fr: Révision locale à gauche
zh_cn: 本地修订版本在左侧

# source-control-settings.local-revision-right
source: Local Revision on Right Side
es_419: Revisión local a la derecha
fr_fr: Révision locale à droite
zh_cn: 本地修订版本在右侧

# source-control-settings.navigator
source: Source control navigator
es_419: Navegador de control de versiones
fr_fr: Navigateur de contrôle de version
zh_cn: 版本控制导航器

# source-control-settings.sort-by-name
source: Sort by Name
es_419: Ordenar por nombre
fr_fr: Trier par nom
zh_cn: 按名称排序

# source-control-settings.sort-by-date
source: Sort by Date
es_419: Ordenar por fecha
fr_fr: Trier par date
zh_cn: 按日期排序
